DataProcessors/ПечатьДопСоглашенияПоУпаковке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПечатьДопСоглашенияПоУпаковке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Факсимиле.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Факсимиле</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПечатьДопСоглашенияПоУпаковке/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	//Фл=Ложь;	
	//Попытка
	//	ЗагрузитьВнешнююКомпоненту("NameDecl.dll");
	//	Компонента = Новый("AddIn.NameDeclension");
	//Исключение
	//   Фл=Истина;
	//КонецПопытки;
	//Если Фл Тогда
	//	Попытка
	//		УстановитьВнешнююКомпоненту("ОбщийМакет.КомпонентаNameDecl");
	//		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаNameDecl", "Склонение", ТипВнешнейКомпоненты.Native);
	//		Компонента = Новый("AddIn.Склонение.NameDeclension");
	//	Исключение
	//		Сообщить("Не удалось установить компоненту склонения");
	//		Фл=Ложь;
	//	КонецПопытки;
	//КонецЕсли; 
	
    ФИОДир="";
	ФИОКлиента="";
	ПолучитьФИО(ФИОДир,ФИОКлиента);
	ОбщиеПроцедуры.ПросклонятьФИО(ФИОДир, 2,,ФИОДир);
	ОбщиеПроцедуры.ПросклонятьФИО(ФИОКлиента, 2,,ФИОКлиента);
	ТабДок = ПечатьДопСоглашение(ФИОДир,ФИОКлиента);
  	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьФИО(ФИОДир,ФИОКлиента)
	Руководители 		= ОбщегоНазначения.ОтветственныеЛица(Объект.Организация, ТекущаяДата(),);
	
	ФИОДир = Строка(Руководители.Руководитель);
	
	ФИОКлиента = Объект.Контрагент.ГенеральныйДиректор;

КонецПроцедуры

&НаСервере
Функция ПечатьДопСоглашение(ФИОДир,ФИОКлиента) Экспорт 

	
//	
	ТабДокумент = Новый ТабличныйДокумент;
  
	Макет = Обработки.ПечатьДопСоглашенияПоУпаковке.ПолучитьМакет("ДопСоглашениеУпаковка");
  
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата());
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДата());
	Руководители 		= ОбщегоНазначения.ОтветственныеЛица(Объект.Организация, ТекущаяДата());
//	
//	//Вывод
//	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//ОбластьМакета.Параметры.ДатаДок 	= Формат(ТекущаяДата(),"ДЛФ=DD");
	ОбластьМакета.Параметры.Организация = Объект.Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.Клиент		= Объект.Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.ДатаДог = Формат(Объект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.НомерДог		= Объект.ДоговорКонтрагента.Номер;
	//	
//	//Склоняем
	
	//ФИОДир = Руководители.Руководитель;
	
	//ЗагрузитьВнешнююКомпоненту("NameDecl.dll");
	//глКомпонентаСклоненияФИО = Новый("AddIn.NameDeclension");

	//ОбщиеПроцедуры.ПросклонятьФИО(ФИОДир, 2,,ФИОДир);
	ОбластьМакета.Параметры.ФИОДир = ФИОДир;
	
	//ФИОКлиента = Контрагент.ГенеральныйДиректор;
	//ОбщиеПроцедуры.Просклонять(ФИОКлиента, 2, ФИОКлиента);

	ОбластьМакета.Параметры.ФИОКлиента = ФИОКлиента;

	ОтвБух=Объект.Контрагент.ОсновнойБухгалтерПоУпаковке;
	Если ЗначениеЗаполнено(ОтвБух.ФизЛицо) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)";

		Запрос.УстановитьПараметр("Объект", ОтвБух.ФизЛицо);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
        ЕмейлБух="";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЕмейлБух=ВыборкаДетальныеЗаписи.Представление;
		КонецЦикла;
	КонецЕсли; 
	ОбластьМакета.Параметры.ЕмейлБух = "upakovka@vkusvill.ru";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)";

	Запрос.УстановитьПараметр("Объект", Объект.Контрагент);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    ЕмейлКлиента="";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕмейлКлиента=ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	ОбластьМакета.Параметры.ЕмейлКлиента = ЕмейлКлиента;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Организация = Объект.Организация.НаименованиеСокращенное;
	ОбластьМакета.Параметры.Покупатель		= Объект.Контрагент.НаименованиеПолное;
	
	ФИОДир = Руководители.Руководитель;
	МасФИО=Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(ФИОДир," ");
	Для каждого Эл Из МасФИО Цикл
	   Эл=СокрЛП(Эл);
	КонецЦикла; 
	ФИОДир=""+МасФИО[0]+" "+?(МасФИО.Количество()>1,Лев(МасФИО[1],1)+".","")+?(МасФИО.Количество()>2,Лев(МасФИО[2],1)+".","");
	ОбластьМакета.Параметры.ФИОДир = ФИОДир;
	                                                                        
	ФИОКлиента = Объект.Контрагент.ГенеральныйДиректор;
	
	МасФИО=Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(ФИОКлиента," ");
	Для каждого Эл Из МасФИО Цикл
	   Эл=СокрЛП(Эл);
	КонецЦикла; 
	ФИОКлиента=""+МасФИО[0]+" "+?(МасФИО.Количество()>1,Лев(МасФИО[1],1)+".","")+?(МасФИО.Количество()>2,Лев(МасФИО[2],1)+".","");
	ОбластьМакета.Параметры.ФИОКлиента = ФИОКлиента;
	
	
	Руководители 		= ОбщегоНазначения.ОтветственныеЛица(Объект.Организация, ТекущаяДата(),);
	ФИОДир = Руководители.Руководитель;
	Факсимиле=Справочники.Факсимиле.НайтиПоРеквизиту("ФизЛицо",ФИОДир);
	Если ЗначениеЗаполнено(Факсимиле) Тогда
	    ДД=Факсимиле.Подпись.Получить();
		Если ТипЗнч(ДД)=Тип("Картинка") Тогда
			//Картинка = Новый Картинка(ДД); 
			ОбластьМакета.Рисунки.Факсимиле.Картинка = ДД; 
		КонецЕсли; 
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакета);
	
    ТабДокумент.ИмяПараметровПечати="ПечатьДопСоглашенияПоУпаковке";
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;



	Возврат ТабДокумент;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект,Параметры);
КонецПроцедуры
